# Lesson 1

Things to learn (How to):
* Create Data
* Get data
* Prepare Data
* Analyze Data
* Present Data

In [1]:
# Import all libraries needed for the tutorial

# General syntax to import specific functions in a library: 
##from (library) import (specific library function)
from pandas import DataFrame, read_csv

# General syntax to import a library but no functions: 
##import (library) as (give the library a nickname/alias)
import matplotlib.pyplot as plt
import pandas as pd #this is how I usually import pandas
import sys #only needed to determine Python version number
import matplotlib #only needed to determine Matplotlib version number
import os

# Enable inline plotting
%matplotlib inline

In [2]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)
print('Matplotlib version ' + matplotlib.__version__)

Python version 3.8.5 (default, Sep  3 2020, 21:29:08) [MSC v.1916 64 bit (AMD64)]
Pandas version 1.1.3
Matplotlib version 3.3.2


## Creating Data

In [3]:
# The initial set of baby names and birth rates
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]

In [4]:
zip?

merging two lists together

In [5]:
BabyDataSet = list(zip(names,births))
BabyDataSet

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

**df** will be a DataFrame object. You can think of this object holding the contents of the BabyDataSet in a format similar to a sql table or an excel spreadsheet. Lets take a look below at the contents inside df.

In [6]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

Exporting the dataframe to a csv file.

In [7]:
df.to_csv?

In [8]:
df.to_csv('births1880.csv',index=False,header=False)

In [9]:
df.to_csv('births1880_1.csv',index=False,header=True)

In [10]:
df.to_csv('births1880_2.csv',index=True,header=False)

In [11]:
df.to_csv('births1880_3.csv',index=True,header=True)

The only parameters we will use is **index** and **header**. Setting these parameters to False will prevent the index and header names from being exported.

## Get Data

In [12]:
read_csv?

In [13]:
Location = r'D:\home\margo\study\HSE\week_1\births1880.csv'
df = pd.read_csv(Location)

In [14]:
df

       Bob  968
0  Jessica  155
1     Mary   77
2     John  578
3      Mel  973

In [15]:
df = pd.read_csv(Location, names=['Names','Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [16]:
os.remove(Location)

In [17]:
Location_1 = r'D:\home\margo\study\HSE\week_1\births1880_1.csv'
df_1 = pd.read_csv(Location_1)

Location_2 = r'D:\home\margo\study\HSE\week_1\births1880_2.csv'
df_2 = pd.read_csv(Location_2)

Location_3 = r'D:\home\margo\study\HSE\week_1\births1880_3.csv'
df_3 = pd.read_csv(Location_3)

In [18]:
df_1

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [19]:
df = pd.read_csv(Location_1, names=['Names','Births'])
df

     Names  Births
0    Names  Births
1      Bob     968
2  Jessica     155
3     Mary      77
4     John     578
5      Mel     973

In [20]:
df = pd.read_csv(Location_1, names=['Names','Births'])
df

     Names  Births
0    Names  Births
1      Bob     968
2  Jessica     155
3     Mary      77
4     John     578
5      Mel     973

In [21]:
df_2

   0      Bob  968
0  1  Jessica  155
1  2     Mary   77
2  3     John  578
3  4      Mel  973

In [22]:
df = pd.read_csv(Location_2, names=['Names','Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [23]:
df = pd.read_csv(Location_2)
df

   0      Bob  968
0  1  Jessica  155
1  2     Mary   77
2  3     John  578
3  4      Mel  973

In [24]:
df_3

   Unnamed: 0    Names  Births
0           0      Bob     968
1           1  Jessica     155
2           2     Mary      77
3           3     John     578
4           4      Mel     973

In [25]:
df = pd.read_csv(Location_3, names=['Names','Births'])
df

       Names  Births
NaN    Names  Births
0.0      Bob     968
1.0  Jessica     155
2.0     Mary      77
3.0     John     578
4.0      Mel     973

In [26]:
df = pd.read_csv(Location_3)
df

   Unnamed: 0    Names  Births
0           0      Bob     968
1           1  Jessica     155
2           2     Mary      77
3           3     John     578
4           4      Mel     973

In [27]:
os.remove(Location_1)
os.remove(Location_2)
os.remove(Location_3)

## Prepare Data

The data we have consists of baby names and the number of births in the year 1880. We already know that we have 5 records and none of the records are missing (non-null values).